rsdata/RSDataTemplate/GetMovEstoque.tmpl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:epi="http://rsdata.com.br/ws/epiEstoqueService">
<soapenv:Header>
<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <wsse:UsernameToken wsu:Id="UsernameToken-1">
	  <wsse:Username>{{ .Usuario }}</wsse:Username>
	  <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{ .Senha }}</wsse:Password>
   </wsse:UsernameToken>
</wsse:Security>
</soapenv:Header>
 
   <soapenv:Body>
      <epi:getEntregasBySetorRequest>
         <epi:dataInicio>{{ .DataIni }}</epi:dataInicio>
         <epi:dataFim>{{ .DataFim }}</epi:dataFim>
         <epi:empresa>
            <!--Optional:-->
            <epi:idEmpresa>?</epi:idEmpresa>
            <epi:codIntegracaoEmpresa>?</epi:codIntegracaoEmpresa>
            <epi:nrCNPJEmpresa>{{.Cnpj}}</epi:nrCNPJEmpresa>
            <epi:razaoSocialEmpresa>?</epi:razaoSocialEmpresa>
            <epi:denominacaoEmpresa>?</epi:denominacaoEmpresa>
         </epi:empresa>
      </epi:getEntregasBySetorRequest>
   </soapenv:Body>
</soapenv:Envelope>
 